{
  "name": "Black Pudding",
  "senses": [
    {
      "name": "blindsight", 
      "value": 60,
      "unit": "ft."
    }
  ],
  "optDefense": {
    "abilities": [
      "split",
      "ooze traits"
    ]
  },
  "specialCMB": [
      {
        "name": "grapple",
        "components": [
          {
            "name": "grab",
            "type": "melee",
            "bonus": 4
          }
        ]
      }
    ],
  "specialCMD": [
    {
      "name": "bull rush",
      "components": [
        {
          "name": "Suction",
          "type": "special ability",
          "bonus": 10
        }
      ]
    },
    {
      "name": "trip",
      "cantFail": true
    }
  ],
  "specialAtk": [
    {
      "name": "constrict", 
      "url": "http://paizo.com/pathfinderRPG/prd/monsters/universalMonsterRules.html#constrict",
      "details": [
        {
          "calc": "damage",
          "type": "weapon",
          "nbDice": 2,
          "dieType": 6,
          "strengthFactor": 1.5
        },
        {
          "text": " plus 2d6 acid"
        }
      ]
    }, 
    {
      "name": "corrosion"
    }
  ],
  "specialAbilities": [
    {
      "title": "Acid (Ex)",
      "description": [
        {
          "text": "A black pudding secretes a digestive acid that dissolves organic material and metal quickly, but does not affect stone. Each time a creature suffers damage from a black pudding's acid, its clothing and armor take the same amount of damage from the acid. A DC"
        }, 
        {
          "calc": "DC", 
          "baseStat": "Con"
        }, 
        {
          "text": "Reflex save prevents damage to clothing and armor. A metal or wooden weapon that strikes a black pudding takes 2d6 acid damage unless the weapon's wielder succeeds on a DC"
        },
        {
          "calc": "DC", 
          "baseStat": "Con"
        }, 
        {
          "text": "Reflex save. If a black pudding remains in contact with a wooden or metal object for 1 full round, it inflicts 21 points of acid damage (no save) to the object. The save DCs are Constitution-based."
        }
      ]
    },
    {
      "title": "Corrosion (Ex)",
      "description": [
        {
          "text": "An opponent that is being constricted by a black pudding suffers a –4 penalty on Reflex saves made to resist acid damage applying to clothing and armor."
        }
      ]
    },
    {
      "title": "Split (Ex)",
      "description": [
        {
          "text": "Slashing and piercing weapons deal no damage to a black pudding. Instead, the creature splits into two identical puddings, each with half of the original's current hit points (round down). A pudding with 10 hit points or less cannot be further split and dies if reduced to 0 hit points."
        }
      ]
    },
    {
      "title": "Suction (Ex)",
      "description": [
        {
          "text": "The black pudding can create powerful suction against any surface as it climbs, allowing it to cling to inverted surfaces with ease. A black pudding can establish or release suction as a swift action, and as long as it is using suction, it moves at half speed. Because of the suction, a black pudding's CMD score gets a +10 circumstance bonus to resist bull rush, awesome blows, and other attacks and effects that attempt to physically move it from its location."
        }
      ]
    }
  ]
}